<script setup lang="ts" generic="T extends any, O extends any">
defineOptions({
  name: 'IndexPage',
})
const appName = '富兴数据智囊'
</script>

<template>
  <div class="protocol">
    <div class="bt" style="text-align: center">
      富兴数据智囊隐私协议
    </div>
   通过移动应用程序使用富兴数据智囊可能涉及收集和使用您的信息。本隐私政策解释并告知您富兴数据智囊如何收集、使用和披露与您通过我们的移动应用程序访问和使用我们的服务相关的信息。了解本隐私政策以及如何保护您的信息对您来说非常重要，因此请仔细阅读本隐私政策。
一、本隐私政策的适用范围
1.1使用富兴数据智囊即表示您同意我们可以根据不时修订的本隐私政策访问、收集、使用和共享您的信息。此外，您使用富兴数据智囊即表示您同意本隐私政策的条款。如果您不同意本隐私政策的条款，请勿使用富兴数据智囊。

1.2 本隐私政策已纳入您为了使用 Surfing 而同意的 Surfing 服务条款并构成其一部分。除非本隐私政策中另有定义或上下文另有要求，本隐私政策中使用的任何术语与富兴数据智囊服务条款中的同等定义术语具有相同的含义。除本隐私政策另有规定外，富兴数据智囊服务条款中的这些条款也适用于本隐私政策。

1.3 收集的任何信息均受收集此类信息时有效的隐私政策的约束。但是，我们可能会不时修改和修改我们的隐私政策。如果我们对本政策做出任何变更（我们认为是重大变更），无论是否通知您，您均同意受修订后的政策的约束。

1.4 富兴数据智囊可能会将您链接到第三方提供的社交媒体或其他功能或服务（包括网站、插件和小部件）。请注意，本隐私政策不适用于可通过我们的服务访问的任何第三方网站、服务或应用程序收集的信息，也不适用于在其网站上宣传其服务的其他公司和组织收集的信息。富兴数据智囊。对于任何第三方使用您向其提供的任何信息，我们不承担任何责任。

2. 当我们提供富兴数据智囊服务时，我们通过下述方式获取有关您的信息。请注意，我们需要某些类型的信息，以便我们可以向您提供富兴数据智囊服务。

1).用户提供的信息

2).出于合法利益自动收集的信息

用户提供的信息

1).您在开设富兴数据智囊账户时向我们提供的信息，包括您的昵称、性别、出生日期、国家/地区、年龄、电子邮件、密码、社交媒体帐户信息（个人资料照片、视频）以及您发布的有关您自己的任何标签；

2) 您的 Surfing 个人资料中包含的其他 Surfing 用户可见的任何信息，或您通过使用 Surfing 向我们提供的信息，其中可能包括您的照片、性别；

3) 用户生成的内容（“UGC”），例如您在使用富兴数据智囊时在应用程序上上传、分发或流式传输的评论、文本、消息、图片、图像、视频、声音、代码或其他数据或材料服务;

4) 支付信息，例如银行账号、Paypal或其他需要支付的支付信息；

5) 您购买付费服务后的交易号、交易记录等交易信息；

6) 您的选择加入以及与我们的沟通，例如用于验证您的帐户或解决您的反馈或投诉的信息以及您在参与应用内调查和活动时提供的信息。

7) 当您通过连接到富兴数据智囊帐户或将富兴数据智囊帐户与第三方社交媒体帐户（例如 Facebook、Google）关联来创建富兴数据智囊帐户时，您从社交媒体提供的信息；

2.为了合法利益而自动收集的信息

⊙ 有关您在其他服务上的帐户的数据：如果您的社交媒体或其他在线帐户与您在我们的服务上的帐户关联，我们可能会通过这些帐户获取某些信息。如果您通过 Facebook 或其他第三方平台登录我们的服务，我们会请求您允许访问有关该其他帐户的某些信息。例如，根据平台或服务的不同，我们可能会收集您的姓名、个人资料照片、性别、信息和出生日期，包括来自 Google 的信息：Google 帐户的唯一 ID； ID令牌； Facebook：AccessToken。这些平台和服务通过其 API 向我们提供信息。我们收到的信息取决于您决定向我们提供的信息（通过您的隐私设置）或平台或服务。如果您通过第三方平台或服务访问或使用我们的服务或点击任何第三方链接，您的数据的收集、使用和共享也将受该第三方的隐私政策和其他协议的约束。

⊙设备标识符，例如您的操作系统、浏览器类型、品牌、型号和移动设备序列号、互联网协议 (IP) 地址、移动运营商、屏幕分辨率、语言设置、IMEI 号码、IMSI 号码和媒体访问控制地址；

⊙网络活动信息，例如您的浏览历史记录、搜索历史记录、您访问过的视频或页面、您访问的日期和时间、您订阅的其他用户帐户以及您与其他用户互动的信息；

⊙如果服务崩溃或挂起，我们还会收集错误报告信息，以便我们调查错误并提高服务未来版本的稳定性。一般来说，这些报告不包含或只是偶然包含个人身份信息。作为这些错误报告的一部分，我们会收到有关您设备的类型和版本、设备标识符、错误发生时间、正在使用的功能以及错误发生时应用程序状态的信息。除了调查和修复错误之外，我们不会将此信息用于任何目的。

⊙有关您访问和使用其他应用程序的信息；

⊙与您提供给我们的UGC相关的元数据描述其他数据，并提供有关UGC剪辑如何、何时、由谁收集以及UGC格式的信息，例如用于标记视频关键字的主题标签和字幕；

我们还可能收集、使用和共享您的信息，以生成和共享无法识别您身份的摘要见解。汇总数据可能源自您的个人信息，但不被视为个人信息，因为这些数据不会直接或间接识别您的身份。例如，我们可能会汇总您的使用数据，以计算访问特定网站功能的用户百分比、生成有关我们用户的统计数据、计算访问特定网站功能的用户百分比，或计算放置的广告展示数量或点击。

2.个人敏感信息特别说明
为了提供某些功能（例如在线视频通话），我们必须在您允许的情况下访问您的麦克风、摄像头，如下所述：

1) 麦克风：我们（在您允许的情况下）访问您设备上的麦克风来录制音频消息并传送声音在视频通话期间。

2）相机：我们会访问您设备上的相机（经过您的许可）来拍摄您的个人资料照片并在视频通话期间提供实时图像。

使用富兴数据智囊即表示您同意敏感个人信息的所有处理活动均出于本隐私政策中所述的目的并按照本隐私政策中所述的方式进行。

请注意，除非您同意，否则我们不会将您的敏感个人信息用于直接营销目的。

2.3儿童信息特别说明 网上富兴数据智囊服务仅适用于年满18周岁的用户。我们不允许18岁以下的用户访问我们的平台，也不会故意收集18岁以下用户的个人信息。

3.我们如何使用我们收集的信息
我们仅在以下情况下使用或可能披露您的个人信息： 验证您的身份；

1) 将您与通过服务启用的其他人联系起来；

2) 在本服务上与他人共享您的个人信息；

3) 允许您使用可能不时提供的服务的某些功能。向您显示正在与您通信的人的姓名，并向您显示正在与您在服务上通信的人的姓名；

4) 向您发送与您使用服务相关的任何管理通知警报和通讯；

5) 向您提供您允许我们向您收集的信息或您向与您的富兴数据智囊账户关联的社交媒体提供商提供的信息您请求的相关内容，例如有关您的位置和您的富兴数据智囊联系人的信息；

6) 通过电子邮件、短信或其他方式与您联系，通知您新产品、服务或促销活动，用于内部运营行为，包括故障排除、数据分析、测试、研究、服务改进、检测和预防错误、欺诈或其他违法行为；活动;

7) 当我们真诚地相信法律、任何法律程序、执法、国家安全或具有公共重要性的问题需要披露时： 为了保护和捍卫我们的权利或财产（包括执行我们的使用条款和其他协议）； 8

) 与涉及富兴数据智囊的公司交易有关，例如购买或出售业务单位、收购、合并、出售资产或其他类似事件。

富兴数据智囊允许您在富兴数据智囊应用程序中与其他用户共享短信、照片、屏幕截图、视频和其他通信，如果您选择这样做，您的短信、照片、屏幕截图、视频和其他通信将存储在我们的服务器上。此外，如果您选择与其他富兴数据智囊用户共享这些项目，我们可能无法将它们从我们的服务器中删除或使您与之共享的任何人都无法使用它们。在富兴数据智囊应用程序中发送和共享短信、照片、屏幕截图、视频或其他通信由您决定。通过选择共享该信息，您应该明白，您可能无法再控制该信息的使用方式，并且该信息可能会公开（部分取决于您的行为或与您共享该信息的其他人的行为） ）。富兴数据智囊对您共享的信息的任何使用或滥用不承担任何责任。

3.2 传输和存储

我们在全球多个司法管辖区运营并可能继续运营服务器，因此使用和存储您个人信息的服务器可能不在您的司法管辖区。

您同意出于本隐私政策中所述的目的传输您的个人信息（在您的管辖范围内和之外）。

3.3 分析

我们使用您的信息的主要原因是为了提供和改进我们的服务。此外，我们使用您的信息来帮助确保您的安全。请继续阅读，详细了解我们使用您的信息的各种原因以及实际示例。

1) 第三方使用情况分析工具：我们使用 Google Inc（1600 Amphitheatre Parkway, Mountain View, CA 94043, USA，“Google”）提供的工具对我们的服务进行使用情况分析。 Firebase 拥有并被 Google 收购的工具用于衡量使用情况。由 Google 运行的 Firebase 也用于使用情况分析。

2) 第三方转化跟踪工具：AppsFlyer、Google 转化跟踪 API 和 Facebook 转化跟踪 API，用于用户转化跟踪。

3）崩溃检测工具：我们使用Firebase拥有的Crashlytics工具进行崩溃检测。它有助于维护和改进服务。您的所有崩溃数据都是匿名收集的。

3.4 共享您的信息

您的信息通过以下方式与他人共享： 在我们的产品上共享

1）未经您的同意，我们不会向第三方（或富兴数据智囊所属的集团公司）出租或出售您的信息，除非如本隐私政策中另有规定，我们可能会与谁共享您的信息：

2) 我们可能会与或成为其共享用户内容和您的信息（包括但不限于 Cookie、日志文件、设备标识符、位数据和使用数据中的信息）在法律上属于 Surfing 公司集团的企业集团（“关联公司”）的一部分。关联公司可以使用此信息来帮助提供、理解和改进服务（包括通过提供分析）及其自己的服务（包括通过向您提供更好、更相关的体验）。但这些联属公司将尊重您对谁可以看到您的内容所做的选择。

3) 我们还可能与帮助我们向您提供服务的第三方组织（“服务提供商”）共享您的信息以及来自 Cookie、日志文件、设备标识符和位置数据等工具的信息。我们的服务提供商将被授予访问权限您的信息，以便根据合理的保密条款提供服务。

4) 我们还可能与第三方（包括广告商和投资者）共享汇总或匿名信息。例如，我们可能会告诉广告商我们的应用程序已收到多少用户。该信息不包含任何个人或个人身份信息，用于开发我们希望您感兴趣的内容和服务。

5) 我们可能会删除一些能够识别您身份的数据，并与其他方共享您的姓名数据。我们还可能以不再与您关联的方式将您的信息与其他信息结合起来并共享此汇总信息，您可以选择参与方您与谁共享您的用户内容：

6) 您自愿披露以发布到服务的任何信息或内容（例如用户内容）将向公众公开。通过此功能，富兴数据智囊可以防止需求狂潮。一旦您分享或公开用户内容，该用户内容可能会被其他人重新分享；

7) 如果您删除在服务上创建的信息和内容（例如屏幕截图等），则该副本可能在服务的缓存和存档页面中仍然可见，或者如果其他用户或第三方已复制或保存该副本信息（例如 Facebook 等）。

3.5 我们为保护您的信息而采取的安全措施

我们采用行政、物理和电子措施来保护您的信息免遭未经授权的访问，但是，尽管做出了这些努力，但没有任何安全措施是完美或坚不可摧的，也没有任何数据传输方法可以保证免受任何未经授权的访问。拦截或其他类型的滥用。如果您的个人信息因安全漏洞而遭到泄露，我们将根据适用法律的要求立即通知您。

如果我们确实与任何第三方共享您的个人信息，我们将尽合理努力确保此类第三方仅在以下情况下使用您的个人信息：

(i) 遵守本隐私政策；

(ii) 遵守我们给予他们的任何其他指示，包括我们实施的任何适当的保密和安全措施。

4.如何访问您的信息
您可以访问和修改您通过您的帐户向我们提供的信息。

如果您认为您在富兴数据智囊上发布的信息不真实或不准确，并且能够向我们提供合理证明，您可以通过本隐私政策中提供的联系方式要求我们更正这些不真实或不准确的信息，我们将尽合理努力尊重您的要求；但是，我们可能会根据法律要求和/或出于记录保存的目的保留您信息的存档副本。

一旦您的帐户被关闭或删除，您将无法再访问您的消息历史记录、偏好设置或与您使用我们的服务相关的任何其他信息。即使您从帐户或个人资料中删除信息后，该信息的副本仍然可以在其他地方查看，只要该信息已与其他人共享、根据您的隐私设置以其他方式分发、或者由其他用户复制或存储。此外，如果为了遵守我们的法律义务（包括执法请求）、满足监管要求、解决争议、维护安全、防止欺诈和滥用或执行条款而有合理必要，即使您关闭了帐户，我们也会保留您的个人数据的服务。您的帐户关闭后，我们将保留非个性化信息。

在某些情况下，我们可能无法更新、修改或删除您的个人信息，在这种情况下，我们会让您知道我们无法这样做的原因，例如，某些请求可能需要不成比例的技术努力或极其不切实际，或者法律禁止的。

由于富兴数据智囊将在多个司法管辖区使用，我们可能无法识别本隐私政策的某些条款与您所在司法管辖区的适用法律之间的所有不一致之处，因此您同意一旦发现此类不一致之处，立即通知我们。在此情况下，我们将采取必要的方法消除这种不一致，包括删除我们不当收集或使用的这些个人信息。

5. 数据访问和删除
您始终可以控制您选择在服务上与我们共享哪些信息。为此，您可以更改服务或移动设备上的设置。或者，您可以从移动设备上完全删除此服务，并且可以随时删除您的数据。如果您要求我们删除您的帐户，我们将尽商业上合理的努力从我们的服务器中删除您的数据。

您在富兴数据智囊应用程序中或通过富兴数据智囊应用程序与其他用户共享或在我们网站或其他地方的博客、公告板或聊天室中提交的短信、照片、视频或任何其他个人身份信息可能会被其他人查看和使用，其中包括发送您主动发送消息或身份盗用。富兴数据智囊对因您的信息泄露而导致的任何使用或误用您的信息不承担任何责任

6. 安全
保护用户隐私和个人信息是 Surfing 的首要任务，我们做出巨大努力来确保您提供给我们的所有个人身份信息的隐私性。所有个人身份信息的访问权限仅限于 Surfing 员工、承包商、代理商和第三方想要了解这些信息以便提供、操作和开发它的服务提供商。维护、支持可以政治化到服务中。

7. 年龄
该服务不针对十八 (18) 岁以下的儿童，并且我们不会在知情的情况下接受或出售十八岁以下儿童的个人身份信息作为我们服务的一部分。如果我们发现我们在服务中无意中收到了 18 岁以下用户的个人身份信息，我们将从我们的记录中删除此类信息。如果我们将来改变我们的做法，作为服务的一部分，我们将在收集 18 岁以下儿童的任何个人身份信息之前获得事先可验证的家长同意。

8. 变更通知
我们保留自行决定更改本隐私政策的权利。您可以随时通过我们网站上的链接查看我们隐私政策的更新。您同意接受富兴数据智囊电子通讯的发布和/或修订后的隐私政策。并且您同意此类电子通信或帖子构成向您发出的隐私政策通知。我们保留不时修改本政策的权利，因此请经常查看。如果我们对本政策进行重大变更，我们将通过发布修订后的隐私政策或在我们的网站上发布通知或法律要求的方式通知您。您同意定期查看隐私政策，以便了解任何更改。您同意，在我们发布修订后的隐私政策或在我们的网站上提供通知后继续使用本服务即表示您接受修订后的隐私政策。如果您不同意隐私政策的条款，则不应使用该服务。

9. 联系我们
如果您对我们的隐私政策或任何隐私相关事宜有任何疑问，请通过电子邮件联系我们【Surfing@Surfing.site】。

    <br><br>
  </div>
</template>

<style scoped>
  .protocol {
    font-size: 14px;
    margin-bottom: 14px;
    color: #000;
    margin-left:6px;
    margin-right:6px;
    background-color: fff;
  }
  .bt {
    font-size: 20px;
    margin: 6px 0px;
    color: #7f1146;
  }
</style>
